app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @content = Content.find(params[:id])

SELECT "contents".* FROM "contents" WHERE "contents"."date" BETWEEN ? AND ?  [["date", "2022-10-10 00:00:00"], ["date", "2022-10-10 23:59:59.999999"]]
SELECT 1 AS one FROM "contents" WHERE "contents"."date" BETWEEN ? AND ? LIMIT ?  [["date", "2022-10-10 00:00:00"], ["date", "2022-10-10 23:59:59.999999"], ["LIMIT", 1]]
INSERT INTO "contents" ("content", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?)  [["content", "deefe"], ["created_at", "2022-10-10 00:57:56.129889"], ["updated_at", "2022-10-10 00:57:56.129889"], ["date", "2022-10-10 00:57:56.127653"]]
---
  def create
    now = Time.current
    if not Content.where(date: now.in_time_zone.all_day).empty?
      update(now)
    elsif
      @content = Content.new(content_params)
      @content.date = now
      if @content.save